### 7. 데이터 합치기와 재구성

### 7.1 멀티 인덱스

In [1]:
#  모듈 불러오기
import numpy as np
import pandas as pd

Series의 멀티 인덱스

In [76]:
# 학생 점수를 시리즈로 생성
# pd.Series(리스트)
# pd.Series(리스트, [인덱스])
# 인덱스는 단일x 멀티o
# 학년-반
# 첫번째 인덱스: 학년(1,2)
# 두번째 인덱스: 반(A,B)
s = pd.Series([ 85, 90, 78, 92, 88, 75 ], 
             index = [ ['1학년', '1학년', '1학년', '2학년', '2학년', '2학년'],
                       ['a반', 'a반', 'b반', 'a반', 'b반', 'b반'] ]
             )
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     b반    75
dtype: int64

In [11]:
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     b반    75
dtype: int64

In [17]:
# 시리즈에서 1학년만 조회
s['1학년']
# 1학년 a반만 조회
s.index
s.loc[('1학년','a반')]
# 1학년의 a반과 b반 모두 가지고 오기 (여러개 선택)
s.loc[ ('1학년', [ 'a반', 'b반' ] ) ]

1학년  a반    85
     a반    90
     b반    78
dtype: int64

In [21]:
s = pd.Series([120, 100, 90, 80],
              index = [['서울','서울','부산','부산'], 
                       ['강남점','강북점','해운대점','서면점']])
s

서울  강남점     120
    강북점     100
부산  해운대점     90
    서면점      80
dtype: int64

In [28]:
# 시리즈에서 값 꺼내기
# 서울 전체 매출을 조회
s['서울']
# 부산 해운대점 매출을 조회
s.loc[('부산','해운대점')]

np.int64(90)

데이터 프레임의 멀티 인덱스

In [31]:
# Series: 한줄짜리 데이터
# DataFrame: 표 모양 데이터

# 상품 판매 데이터를 데이터프레임으로 생성
# pd.DataFrame(2차원 배열 데이터)
# pd.DataFrame(데이터, [인덱스], [컬럼])
# 데이터: 4행 2열의 배열. 판매데이터 (판매량)
# 행 인덱스: 멀티(연도-지점)
# 열 컬럼: 제품
df = pd.DataFrame( [ [50, 60], [70, 80], [100, 110], [120, 130] ], 
                   index = [ ['2020년', '2020년', '2021년', '2021년'], 
                             ['구월점', '부평점', '구월점', '부평점'] ], 
                   columns = ['제품1', '제품2'] )
df

           제품1  제품2
2020년 구월점   50   60
      부평점   70   80
2021년 구월점  100  110
      부평점  120  130

데이터프레임에서 데이터 꺼내기

In [35]:
# 2020년도 전체 판매량 조회
print(df.index)
print(df.columns)
# df.loc[행, 열]
df.loc['2020년']

MultiIndex([('2020년', '구월점'),
            ('2020년', '부평점'),
            ('2021년', '구월점'),
            ('2021년', '부평점')],
           )
Index(['제품1', '제품2'], dtype='object')

     제품1  제품2
구월점   50   60
부평점   70   80

In [43]:
# 2020년 구월점 판매량만 조회
print(df.loc[('2020년','구월점')])
# 2021년 부평점의 제품2 판매량만 조회
print(df.loc[('2021년','부평점')])

제품1    50
제품2    60
Name: (2020년, 구월점), dtype: int64
제품1    120
제품2    130
Name: (2021년, 부평점), dtype: int64

#### 7.2 데이터 합치기

merge
- 두개의 데이터프레임을 하나로 합치는 함수
- 기준 컬럼이 맞으면 해결

In [46]:
# 학색 데이터를 담아서 데이터프레임 생성
# pd.DataFrame(2차원배열)
# pd.DataFrame(dic)
df1 = pd.DataFrame( { '학번' : [ 1, 2, 3 ], '이름' : [ '철수', '영희', '민수' ] } )
# 시럼 점수 데이터를 담아서 데이터프레임 생성
df2 = pd.DataFrame( { '학번' : [ 1, 2, 4] , '점수' : [ 90, 85, 70 ] } )

In [47]:
df1

   학번  이름
0   1  철수
1   2  영희
2   3  민수

In [48]:
df2

   학번  점수
0   1  90
1   2  85
2   4  70

merge의 종료
- inner join: 양쪽 데이터에서 공통된 부분만 가지고옴
- left join: 왼쪽 데이터는 모두 가지고 오고, 오른쪽은 겹치는 부분만
- right join: 오른쪽 데이터는 모두 가지고 오고, 오른쪽은 겹치는 부분만
- outer join: 양쪽 데이터를 모두 가지고옴

In [51]:
# 학생정보와 시험점수 합치기
# pd.merge(데이터1, 데이터2, 공통컬럼)
# inner join (기본값)
pd.merge(df1, df2, on='학번')

   학번  이름  점수
0   1  철수  90
1   2  영희  85

In [55]:
# # pd.merge(데이터1, 데이터2, 공통컬럼, [join방식])
# left join
pd.merge(df1, df2, on = '학번', how = 'left')

   학번  이름    점수
0   1  철수  90.0
1   2  영희  85.0
2   3  민수   NaN

In [56]:
# right join
pd.merge(df1, df2, on = '학번', how = 'right')

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   4  NaN  70

In [57]:
# outer join
pd.merge(df1, df2, on = '학번', how = 'outer')

   학번   이름    점수
0   1   철수  90.0
1   2   영희  85.0
2   3   민수   NaN
3   4  NaN  70.0

concat
- 여러개의 데이터를 이어붙이는 함수
- 조건없이 그냥 이어붙임
- 방향: 위아래 / 옆으로

In [58]:
# 학색 데이터를 담아서 데이터프레임 생성
df1 = pd.DataFrame( { '학번' : [ 1, 2, 3 ], '이름' : [ '철수', '영희', '민수' ] } )
# 시럼 점수 데이터를 담아서 데이터프레임 생성
df2 = pd.DataFrame( { '학번' : [ 1, 2, 4] , '점수' : [ 90, 85, 70 ] } )

In [59]:
df1

   학번  이름
0   1  철수
1   2  영희
2   3  민수

In [60]:
df2

   학번  점수
0   1  90
1   2  85
2   4  70

In [66]:
# 두 데이터 이어 붙이기
# 데이터가 2개 이상이 될 수 있기 때문에, 리스트로 입력
# pd.concat(리스트)
# 방향: 기본값 axis = 0 (y축 위아래)
pd.concat( [ df1, df2 ] )

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
0   1  NaN  90.0
1   2  NaN  85.0
2   4  NaN  70.0

In [68]:
# pd.concat( 데이터 리스트, [방향] )
# axis = 1 (x축 옆으로)
pd.concat( [ df1, df2 ], axis = 1 )

   학번  이름  학번  점수
0   1  철수   1  90
1   2  영희   2  85
2   3  민수   4  70

In [70]:
# concat 후에 인덱스 재설정
# pd.concat(리스트, [인덱스 옵션])
# ignore_index
pd.concat([df1, df2], ignore_index = True)

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
3   1  NaN  90.0
4   2  NaN  85.0
5   4  NaN  70.0

#### 7.3 데이터 재구성

피봇(pivot)
- 행열을 바꿔서 표를 재구성 하는 함수

In [71]:
# 학생의 시험 점수를 데이터프레임에 저장
df = pd.DataFrame( { '이름' : ['철수','영희','철수','영희'],
                     '과목' : ['국어','국어','수학','수학'],
                     '점수' : [90,85,80,95] } )
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [72]:
# 이 표는 데이터를 저장, 수정하기에는 좋지만
# 조회하는 건 불편함

In [75]:
# 이 데이터를 성적표 형태로 변경
# df.pivot(인덱스, 컬럼, 데이터)
# 원본 데이터의 컬럼 중에서 선택
result = df.pivot(index = '이름', columns = '과목' , values = '점수')
# 새로 만든 데이터 프레임의 행 열 확인
print(result.index)
print(result.columns)

Index(['영희', '철수'], dtype='object', name='이름')
Index(['국어', '수학'], dtype='object', name='과목')

In [77]:
result

과목  국어  수학
이름
영희  85  95
철수  90  80